app/controllers/authors_controller.rb

  def edit
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 5]]

  def update
    @author = Author.find(params[:id])
    @author.update(author_params)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "authors" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "authors"."id" = ?

  def create
    @author = Author.create(author_params)
---
INSERT INTO "authors" ("bio", "name", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["bio", "From Minnesota"], ["name", "Garrison Keilor"], ["genre", "Family Radio"], ["created_at", "2017-03-16 14:37:07.854610"], ["updated_at", "2017-03-16 14:37:07.854610"]]