app/controllers/posts_controller.rb

  def create
	  @post = Post.new(post_params)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Asdf"], ["description", "asdfzxcv"], ["created_at", "2017-10-25 02:30:55.954246"], ["updated_at", "2017-10-25 02:30:55.954246"]]